[{"Last_name":"Barber","First_name_MI":"Joseph","Diocese":"Camden","Churches":"Our Lady of Mt. Carmel (Berlin), St. Joseph's High School (Camden), Camden Catholic High Scool (Cherry Hill), St. Mary (Cherry Hill), St. Edward (Pine Hill)","Year Born":1933,"Year Ordained":1961,"Victim Number":"","Status":"Deceased"},{"Last_name":"Bender","First_name_MI":"Claude J.","Diocese":"Camden","Churches":"St. Anthony (Camden), St. Ann (Wildwood), St. Gregory (Magnolia), O.L Star of the Sea (Cape May), St. Michael (Gibbstown), St. Thomas More (Cherry Hill), St. Matthew (National Park), St. Teresa (Runnemede), Our Lady of Lourdes (Glassboro), St. Michael (Atlantic City), Queen of the Apostles (Pennsville), Our Lady of Good Counsel (Ocean City), St. Rose of Lima (Newfield), Vianney Villa (Cherry Hill)","Year Born":1932,"Year Ordained":1965,"Victim Number":"","Status":"Deceased"},{"Last_name":"Bernard","First_name_MI":"John P.","Diocese":"Camden","Churches":"Blessed Sacrament (Margate), Annunciation (Bellmawr), St. Margaret (Woodbury Heights), Holy Savior (Westmont), Sts. Peter & Paul (Washington Township), Chaplain Pomona Air Base, Veteran's Administrative Hospital (Batavia, NY)","Year Born":1930,"Year Ordained":1962,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Blaszczynski","First_name_MI":"Henry S.","Diocese":"Camden","Churches":"St. Cecilia (Pennsauken), St. Joseph - South (Camden), St. Rose (Haddon Heights), St. Mary Magdalen (Millville), Holy Name (Camden), St. Joseph (Somers Point), St. Matthew (National Park), Epiphany (Longport), Corpus Christi (Carney's Point), St. Joan of Arc (Camden), St. Paul (Stone Harbor), St. Lawrence (Lindenwold)","Year Born":1916,"Year Ordained":1941,"Victim Number":"","Status":"Deceased"},{"Last_name":"Bloh","First_name_MI":"John F.","Diocese":"Camden","Churches":"O.L. Star of the Sea (Atlantic City), Holy Spirit High School (Absecon), St. Cecilia (Pennsauken), St. Bartholomew (Camden), St. Jude (Blackwood), St. Mary (Cherry Hill), Most Holy Redeemer (Westville Grove), St. Agnes (Blackwood), St. Edward (Pine Hill), Sts. Peter & Paul (Turnersville), St. Joseph (Swedesboro), Campus Minister Camden County College (Blackwood), Campus Minister Gloucester County College (Sewell)","Year Born":1931,"Year Ordained":1964,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Bohrer","First_name_MI":"John D.","Diocese":"Camden","Churches":"St. Cecilia (Pennsauken), St. Pius X (Cherry Hill), Diocese of Santa Fe, St. Joseph Pro-Cathedral (Camden), Out Lady of Mt. Carmel (Berlin), St. Peter Celestine (Cherry Hill), Advanced Studies (California), Our Lady of Lourdes (Glassboro), Our Lady of the Pillar (Half Moon Bay, CA), Sacred Heart South (Cherry Hill), Holy Name of Jesus (Mullica Hill), Catholic Community of the Holy Spirit (Mullica Hill), Holy Saviour (Westmont), Blessed Teresa of Calcutta (Collingswood), Saint Teresa of Calcutta (Collingswood)","Year Born":1944,"Year Ordained":1978,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Brennan","First_name_MI":"Joseph J.","Diocese":"Camden","Churches":"St. Augustine (Ocean City), O.L. Lourdes Hospital Chaplain, Holy Saviour (Westmont), St. Maurice (Brooklawn), St. Joan of Arc (Camden), St. Joseph (Swedesboro), Epiphany (Longport), St. Mary's (Shelby, NC)","Year Born":1914,"Year Ordained":1944,"Victim Number":"","Status":"Deceased"},{"Last_name":"Cannon","First_name_MI":"William B.","Diocese":"Camden","Churches":"St. Peter (Pleasantville), St. Joan of Arc (Camden), Holy Name (Camden), St. Michael (Minotola), St. Vincent de Paul (Mays Landing), St. Lawrence (Lindenwold), Immaculate Heart of Mary (Woodlynne), Queen of Heaven (Cherry Hill), St. Martin de Porres (Hammonton), Christ the King (Haddonfield), St. Pius X (Cherry Hill), Chaplain Kessler Memorial Hospital (Hammonton)","Year Born":1927,"Year Ordained":1954,"Victim Number":"","Status":"Deceased"},{"Last_name":"Clements","First_name_MI":"Gerald P.","Diocese":"Camden","Churches":"O.L. of Mt. Carmel (Berlin), Most Holy Redeemer (Westville Grove), Camden Catholic High School (Cherry Hill), Holy Savior (Westmont), St. Peter (Merchantville), St. Joseph (South Camden), Director - Vianney Villa, Director - Sacred Heart Residence, Chaplain West Jersey Hospital (Camden)","Year Born":1941,"Year Ordained":1970,"Victim Number":"","Status":"Deceased"},{"Last_name":"Connelly","First_name_MI":"Norman T.","Diocese":"Camden","Churches":"O.L. Star of the Sea (Cape May), St. Rose (Haddon Heights), Cathedral Academy (Camden), Immaculate Conception (Camden), St. Peter (Merchantville), St. Patrick (Woodbury), St. James High School (Carneys Point), St. Michael (Gibbstown), St. John (Paulsboro), St. Joseph (Woodstown), Epiphany (Venice Florida)","Year Born":1937,"Year Ordained":1965,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Connor","First_name_MI":"John P.","Diocese":"Camden","Churches":"St. Francis of Assisi (Vineland), St. Mary (Gloucester), Paul VI High School (Haddon Township), St. Rose (Haddon Heights), Bishop Eustace Preparatory School (Cherry Hill), St. John (Collingswood), Diocese of Pittsburgh, St. Alphonsus (Wexford PA), St. James (Sewickley PA), Immaculate Conception (Bridgeton), St. Teresa of Avila (Bridgeton), Sacred Heart Priest Residence, Chaplain - Bridgeton/Millville Hospitals, Vianney Renewal Center (Dittmer, MO)","Year Born":1934,"Year Ordained":1962,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"D'Amico","First_name_MI":"Michael H.","Diocese":"Camden","Churches":"St. Augustine (Ocean City), Most Holy Redeemer (Westville Grove), St. Michael (Atlantic City), Holy Spirit High School (Absecon), St. Francis Cabrini (Ocean City), St. Peter (Pleasantville)","Year Born":1939,"Year Ordained":1964,"Victim Number":"","Status":"Deceased"},{"Last_name":"Davis","First_name_MI":"Charles J.","Diocese":"Camden","Churches":"St. Monica (Atlantic City), St. Luke (Stratford), St. Agnes (Blackwood), St. James (Ventnor), Diocese of Trenton, St. Francis (Metuchen), US Army - Chaplain, Fort Dix (NJ), Fort Hamilton (NY), 173 Airbase Bd (Vietnam), Fort Monmouth (NJ), St. Mary (Williamstown), Immaculate Heart of Mary (Woodlynne), Fort Benning (Georgia), HQ 172 Inf Bde (Alaska), Post Chapel (Ft. Meade, MD), US Army Chaplain School (Ft. Wadsworth), 19th Support Command (San Francisco), LaSalle College (PA), Fayetteville (NY), APO (NY), Fort Rucker (Alabama), Our Lady of Victories (Crestview FL)","Year Born":1932,"Year Ordained":1962,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Demarest","First_name_MI":"Kenneth","Diocese":"Camden","Churches":"St. Joseph (Swedesboro), St. Joseph (Woodstown)","Year Born":1938,"Year Ordained":1976,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Doyle","First_name_MI":"Vincent A.","Diocese":"Camden","Churches":"Sacred Heart (Vineland), Holy Name (Camden), St. Edward (Pine Hill), O.L. of Mt. Carmel (Berlin), St. George (Camden), O.L. of the Angels (Cape May Court House), St. Francis (Barrington), St. Bridget (Glassboro), St. Nicholas (Egg Harbor), St. Anne (Westville), St. Michael (Cedarville), St. Anthony (Waterford), St. Mary’s Nursing Home (Cherry Hill), St. Joan of Arc (Camden)","Year Born":1924,"Year Ordained":1949,"Victim Number":"","Status":"Deceased"},{"Last_name":"Evans","First_name_MI":"Eldridge T.","Diocese":"Camden","Churches":"Immaculate Conception Cathedral (Bridgeton), Assumption (Atco), St. Mary (Salem), St. Joseph (Woodstown), San Juan Puerto Rico, Corpus Christi (Carney’s Point), St. Casimir (Woodbine), Leave (Puerto Rico), O.L. Star of the Sea (Cape May), St. Agnes (Blackwood), Diocese of Burlington (Vermont), St. Bartholomew (Camden), Our Lady of Lourdes (Glassboro), Holy Spirit (Atlantic City), St. Anthony (Waterford), St. James High School (Carneys Point), Chaplain West Jersey Hospital (Camden), Chaplain Virtua Hospital (Berlin)","Year Born":1939,"Year Ordained":1965,"Victim Number":"","Status":"Deceased"},{"Last_name":"Flemming","First_name_MI":"Francis J.","Diocese":"Camden","Churches":"Sacred Heart (Vineland), Puerto Rican Apostolate, Sacred Heart High School (Vineland), Christ the King (Haddonfield), St. Mary of the Angels Academy (Haddonfield), St. Bartholomew (Camden), St. Peter Celestine (Cherry Hill), Most Holy Redeemer (Westville), Our Lady Star of the Sea (Atlantic City), St. Joseph (Swedesboro), St. John Neumann (Sicklerville)","Year Born":1935,"Year Ordained":1961,"Victim Number":"","Status":"Deceased"},{"Last_name":"Follett","First_name_MI":"John E.","Diocese":"Camden","Churches":"Sacred Heart (Vineland), St. James (Ventnor), St. Mary (Gloucester), St. Thomas (Brigantine), St. Catherine (Clayton), St. Maria Goretti (Runnemede), Chaplain Air National Guard (Pomona)","Year Born":1957,"Year Ordained":1978,"Victim Number":"","Status":"Deceased"},{"Last_name":"Gerbino","First_name_MI":"A. Richard","Diocese":"Camden","Churches":"O.L. of Mt. Carmel (Camden), St. Francis of Assisi (Vineland), St. Rose of Lima (Haddon Heights), O.L. Star of the Sea (Cape May), Corpus Christi (Carneys Point), Assumption (Atco), St. Patrick (Woodbury), Chaplain Newman Club Rutgers (Camden), Chaplain Air National Guard Headquarters (Camden)","Year Born":1924,"Year Ordained":1952,"Victim Number":"","Status":"Deceased"},{"Last_name":"Gillespie","First_name_MI":"Edward","Diocese":"Camden","Churches":"St. Margaret (Woodbury Heights), St. Mary (Williamstown), St. Mary Magdalen (Millville), Sacred Heart High School (Vineland), St. Isidore the Farmer (Vineland), Vianney Villa (Cherry Hill), Chaplain West Jersey (Voorhees), Chaplain St. Mary’s Nursing Home and Manor (Cherry Hill)","Year Born":1948,"Year Ordained":1980,"Victim Number":"","Status":"Deceased"},{"Last_name":"Hardin","First_name_MI":"Roy T.","Diocese":"Camden","Churches":"Our Lady Star of the Sea (Cape May), St. Mary (Cherry Hill), Most Holy Redeemer (Westville), St. Martin de Porres (Hammonton), St. Joseph High School (Hammonton), Assumption (Atco), St. Edward (Pine Hill), Resurrection (Marmora), St. Isidore (Vineland), St. Mary (Williamstown), Blessed Sacrament (Margate), St. Mary (Rosenhayn), St. Anne (Westville)","Year Born":1937,"Year Ordained":1964,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Harkins","First_name_MI":"Thomas M.","Diocese":"Camden","Churches":"St. Teresa (Runnemede), O.L. of Mt. Carmel (Camden), Holy Name (Camden), St. Anthony of Padua (Hammonton), Diocese of Gallup (New Mexico), St. Mary (Cherry Hill), Holy Savior (Westmont), Camden Catholic High School (Cherry Hill), St. Stephen (Pennsauken), Immaculate Conception (Camden), Chaplain Camden County Jail (Camden), Chaplain Riverfront State Prison (Camden)","Year Born":1946,"Year Ordained":1971,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Hopkins","First_name_MI":"James F.","Diocese":"Camden","Churches":"Holy Maternity (Audubon), St. Cecilia (Pennsauken), Annunciation (Bellmawr), Holy Family (Turnersville), St. Vincent de Paul (Mays Landing), St. Peter (Merchantville), St. Aloysius (Oaklyn), St. Pius X (Cherry Hill), St. Maurice (Brooklawn)","Year Born":1943,"Year Ordained":1968,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Hudson","First_name_MI":"Frank X.","Diocese":"Camden","Churches":"St. Mary (Gloucester), O.L. Star of the Sea (Atlantic City), St. Aloysius (Oaklyn), Camden Catholic High School (Cherry Hill), Most Holy Redeemer (Westville), St. Veronica (Delair), St. Peter (Pleasantville), St. Francis (Vineland), Immaculate Conception (Bridgeton), St. Michael (Cedarville), St. John Bosco (Millville), St. John (Deptford)","Year Born":1944,"Year Ordained":1974,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Igle","First_name_MI":"Edward A.","Diocese":"Camden","Churches":"St. Cecilia (Pennsauken), St. John Vianney (Deptford), Immaculate Conception (Camden), St. John (Collingswood), St. Catherine (Clayton), St. Rose (Newfield), Chaplain Cooper University Hospital (Camden)","Year Born":1947,"Year Ordained":1974,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Johnson","First_name_MI":"A. William","Diocese":"Camden","Churches":"St. Ann (Westville), St. Agnes (Blackwood), St. Rose of Lima (Haddon Heights), St. Augustine (Ocean City), St. Gregory (Magnolia), Sacred Heart (Camden), St. John (South Carolina)","Year Born":1936,"Year Ordained":1962,"Victim Number":"","Status":"Left Diocese in 1967- current whereabouts unknown"},{"Last_name":"Kelly","First_name_MI":"John P.","Diocese":"Camden","Churches":"St. Rose (Newfield), Sacred Heart (Camden), Saint Monica (Atlantic City), Temporary Assignment Diocese of Trenton (Sea Bright), St. Peter (Merchantville), Our Lady Star of the Sea (Atlantic City), St. Gregory (Magnolia), St. Charles Borromeo (Washington Twp.), Sacred Heart (Vineland), Assumption (Atco), St. Michael (Cedarville), Our Lady of Victories (Landisville), Chaplain Gibbsboro Air Force Station (Gibbsboro)","Year Born":1930,"Year Ordained":1962,"Victim Number":"","Status":"Deceased"},{"Last_name":"Kuhl","First_name_MI":"Charles E.","Diocese":"Camden","Churches":"O.L. Star of the Sea (Atlantic City), Queen of Heaven (Erlton), St. Ann (Wildwood), St. Luke (Stratford), Camden Catholic High School (Camden), O.L. of Mt. Carmel (Berlin), St. Peter (Merchantville), Our Lady of Lourdes Nursing School (Camden), Paul VI High School (Haddon Township), St. Michael (Atlantic City), St. Bridget (Glassboro), St. Anthony (Waterford)","Year Born":1927,"Year Ordained":1954,"Victim Number":"","Status":"Deceased"},{"Last_name":"Lucano","First_name_MI":"Edward","Diocese":"Camden","Churches":"Our Lady of Mt. Carmel (Camden), Saint Joseph (Swedesboro), Saint Cecilia (Pennsauken), Immaculate Conception (Camden), Holy Spirit (Atlantic City), Sacred Heart (Vineland), Saint Teresa (Runnemede), Saint Peter (Pleasantville), Holy Rosary (Ashland), Saint Mary (Rosenhayn), St. Edward (Pine Hill), St. John Bosco (Millville), Resurrection (Marmora)","Year Born":1923,"Year Ordained":1949,"Victim Number":"","Status":"Deceased"},{"Last_name":"Lyons","First_name_MI":"Dermott F.","Diocese":"Camden","Churches":"St. Paul (Stone Harbor), St. Luke (Stratford), Paul VI High School (Haddon Township), St. Joan of Arc (Camden), St. Joseph (Sea Isle), Epiphany (Longport), St. Teresa (Runnemede)","Year Born":1939,"Year Ordained":1967,"Victim Number":"","Status":"Deceased"},{"Last_name":"Madden","First_name_MI":"Patrick J.","Diocese":"Camden","Churches":"St. John (Collingswood), Catholic University, Blessed Sacrament, O.L. of Mt. Carmel (Berlin), St. Joseph (E. Camden), St. Rose (Newfield), St. Mary Magdalen (Millville), St. Luke (Stratford), St. Lawrence (Lindenwold), O.L. Star of the Sea (Cape May)","Year Born":1919,"Year Ordained":1945,"Victim Number":"","Status":"Deceased"},{"Last_name":"Matthews","First_name_MI":"Phillip A.","Diocese":"Camden","Churches":"Assumption (Wildwood Crest), O.L. of Mt. Carmel (Berlin), St. Lawrence (Lindenwold), Blessed Sacrament (Margate), St. Cecilia (Pennsauken)","Year Born":1939,"Year Ordained":1967,"Victim Number":"","Status":"Deceased"},{"Last_name":"McCloskey","First_name_MI":"Francis A.","Diocese":"Camden","Churches":"Holy Spirit (Asbury Park), O.L. of Victories (Sayreville), St. Joseph (Woodstown), St. Rose (Haddon Heights)","Year Born":1889,"Year Ordained":1915,"Victim Number":"","Status":"Deceased"},{"Last_name":"McColgan","First_name_MI":"Charles P.","Diocese":"Camden","Churches":"St. Luke (Stratford), Immaculate Conception (Camden), St. Mary (Gloucester), St. Peter (Merchantville), St. Bernadette (Northfield), St. Thomas More (Cherry Hill), O.L. of the Angels (Cape May Court House), St. Edward (Pine HIll), St. Rose (Haddon Heights), St. Mary (Gloucester), St. Joan of Arc (Camden), St. Nicholas (Egg Harbor), Most Holy Redeemer (Westville), American College (Louvain Belgium)","Year Born":1930,"Year Ordained":1964,"Victim Number":"","Status":"Deceased"},{"Last_name":"McElroy","First_name_MI":"John J.","Diocese":"Camden","Churches":"St. Francis de Sales (Barrington)","Year Born":1958,"Year Ordained":1985,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"McGarvey","First_name_MI":"Joseph","Diocese":"Camden","Churches":"St. Joseph (East Camden), St. Cecilia (Pennsauken), St. Mary (Gloucester), St. Joseph (Woodstown), St. Ann (Elmer), St. Mary Magdalen (Millville), St. Maria Goretti (Runnemede)","Year Born":1925,"Year Ordained":1950,"Victim Number":"","Status":"Deceased"},{"Last_name":"McLaughlin","First_name_MI":"Francis J.","Diocese":"Camden","Churches":"St. Thomas (Brigantine), Queen of Apostles (Brigantine), Assumption (Atco), St. John (Paulsboro), Corpus Christi (Carneys Point), St. Peter Celestine (Cherry Hill), St. Joseph (Swedesboro), St. Francis de Sales (Barrington)","Year Born":1930,"Year Ordained":1962,"Victim Number":"","Status":"Deceased"},{"Last_name":"Orsini","First_name_MI":"Joseph","Diocese":"Camden","Churches":"St. Isidore (Vineland), Sacred Heart (Mt. Ephraim), Camden Catholic High School (Cherry Hill), O.L. of Mt. Carmel (Camden), St. Paul (Stone Harbor), St. Agnes (Blackwood), St. Edward (Pine Hill), Gloucester Catholic High School (Gloucester), Campus Minister Rutgers University (Camden), Immaculate Conception (Camden), Holy Rosary (Cherry Hill), Immaculate Heart of Mary (Woodlynne), Campus Minister Stockton/Atlantic County Community College, Assumption (Pomona), Holy Spirit (Atlantic City)","Year Born":1937,"Year Ordained":1964,"Victim Number":"","Status":"Deceased"},{"Last_name":"Osinski","First_name_MI":"Peter J.","Diocese":"Camden","Churches":"St. Andrew (Gibbsboro), Assumption (Wildwood Crest), St. Maria Goretti (Runnemede), Paul VI High School (Haddon Township), St. Lucy (Blue Anchor), Immaculate Hear of Mary (Woodlynne), Divine World College (Washington DC), Sacred Heart High School (Vineland), St. John Bosco (Millville), Camden Catholic High School (Cherry Hill), Our Lady of Grace (Somerdale), St. Stephen (Pennsauken), St. James High School (Carneys Point), St. Michael (Gibbstown), Queen of the Apostles (Pennsville)","Year Born":1943,"Year Ordained":1969,"Victim Number":"","Status":"Deceased"},{"Last_name":"Pisik","First_name_MI":"Timothy E.","Diocese":"Camden","Churches":"St. Thomas More (Cherry Hill), St. Michael (Gibbstown), St. Thomas (Brigantine), St. Mary (Salem), St. Michael (Cedarville), Mary, Mother of the Church (Bellmawr)","Year Born":1947,"Year Ordained":1974,"Victim Number":"","Status":"Deceased"},{"Last_name":"Reilly","First_name_MI":"Walter T.","Diocese":"Camden","Churches":"St. Agnes (Blackwood), Immaculate Conception (Camden), St. Gregory (Magnolia), Moderator Holy Child Day Camp, St. Lawrence (Laurel Springs), Sacred Heart (Vineland), Sacred Heart High School (Vineland), O.L. of Mt. Carmel (Camden), Camden Catholic High School (Camden), St. Patrick (Woodbury), St. Joseph (Woodstown), St. James High School (Carneys Point), St. Michael (Cedarville), St. John Vianney (Blackwood Terrace), St. Edward (Pine Hill)","Year Born":1929,"Year Ordained":1956,"Victim Number":"","Status":"Deceased"},{"Last_name":"Rigney","First_name_MI":"Dennis J.","Diocese":"Camden","Churches":"St. Mary (Gloucester), St. Joseph (East Camden), St. Joseph (Somers Point), Sacred Heart (Camden), Holy Saviour (Westmont), Our Lady of Victories (Landisville), Our Lady Queen of Peace (Pitman), St. Anne (Westville), St. Pius X (Cherry Hill), St. Vincent Pallotti (Haddon Township)","Year Born":1914,"Year Ordained":1942,"Victim Number":"","Status":"Deceased"},{"Last_name":"Rigney","First_name_MI":"Philip T.","Diocese":"Camden","Churches":"Our Lady Star of the Sea (Atlantic City), Immaculate Conception (Camden), St. Joseph (East Camden), Sacred Heart (Mt. Ephraim), Holy Maternity (Audubon), St. Joseph (Sea Isle), St. Francis de Sales (Barrington), Queen of Peace (Pitman)","Year Born":1916,"Year Ordained":1949,"Victim Number":"","Status":"Deceased"},{"Last_name":"Robertson","First_name_MI":"Glendon E.","Diocese":"Camden","Churches":"Holy Spirit (Atlantic City), Catholic University, St. Mary (Gloucester), Gloucester Catholic High School (Gloucester), St. Mary (Salem), St. James High School (Carneys Point), St. Aloysius (Oaklyn), Holy Spirit High School (Absecon), St. Thomas (Brigantine - weekends), St. Andre (Gibbsboro)","Year Born":1927,"Year Ordained":1957,"Victim Number":"","Status":"Deceased"},{"Last_name":"Ryan","First_name_MI":"James","Diocese":"Camden","Churches":"St. Francis de Sales (Barrington), St. Anne (Westville), St. Joseph (Somers Point), St. Nicholas (Egg Harbor), St. Margaret (Woodbury Heights), St. James (Penns Grove), St. Joseph (Somers Point), St. Michael (Cedarville), Transfiguration (West Collingswood), St. Cecilia (Pennsauken), St. Bernadette (Northfield), Transfiguration (West Collingswood), St. James (Ventnor), St. John of God (North Cape May), Chaplain Shore Memory Hospital (Somers Point), Chaplain Prison Ministry (Camden)","Year Born":1940,"Year Ordained":1966,"Victim Number":"","Status":"Deceased"},{"Last_name":"Salamandra","First_name_MI":"Francis L.","Diocese":"Camden","Churches":"St. Matthew (National Park), Camden Catholic High School (Cherry Hill), St. Aloysius (Oaklyn), St. Ann (Wildwood), St. Stephen (Pennsauken), O. L. of Good Counsel (Ocean City), St. Rose (Newfield)","Year Born":1931,"Year Ordained":1961,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Schmid","First_name_MI":"Robert","Diocese":"Camden","Churches":"Sacred Heart (Vineland), St. Maria Goretti (Runnemede), St. Lawrence (Lindenwold)","Year Born":1945,"Year Ordained":1971,"Victim Number":"","Status":"Left diocese in 1978 - current whereabouts unknown"},{"Last_name":"Seidenburg","First_name_MI":"Augustine","Diocese":"Camden","Churches":"Sacred Heart (Camden), Holy Name (Camden), US Naval Reserve, Naval Hospital (Long Island), F. P. O. (San Francisco), U.S. Naval Air Station (Norfolk), St. Ann (Wildwood), St. Joseph (East Camden), St. James (Penns Grove), St. James High School (Carneys Point), St. Raymond (Villas), Holy Spirit (Atlantic City), St. Peter (Pleasantville), Holy Spirit High School (Atlantic City), St. Gregory (Magnolia), O.L. Star of the Sea (Cape May), St. Thomas (Brigantine), St. James (Ventnor), St. Augustine (Ocean City)","Year Born":1922,"Year Ordained":1948,"Victim Number":"","Status":"Deceased"},{"Last_name":"Shannon","First_name_MI":"Joseph","Diocese":"Camden","Churches":"Assumption (Wildwood Crest), St. Bridget (Glassboro), Sacred Heart (Camden), St. Mary (Williamstown), St. Anthony of Padua (Camden), St. Joseph Pro-Cathedral (Camden), St. John (Collingswood), St. Joan of Arc (Camden), St. Michael (Cedarville), Sts. Peter and Paul (Turnersville), St. Patrick (Woodbury), Chaplain Underwood Memorial Hospital (Woodbury)","Year Born":1926,"Year Ordained":1961,"Victim Number":"","Status":"Deceased"},{"Last_name":"Sheehan","First_name_MI":"Donal","Diocese":"Camden","Churches":"Sacred Heart (Camden), St. Rose of Lima (Haddon Heights), St. Mary (Williamstown), St. Joseph High School (Hammonton), St. Raymond (Villas), Incarnation (Mantua), Holy Spirit (Atlantic City), Blessed Sacrament (Margate), Our Lady of the Angels (Cape May), St. Joseph (Somers Point), Post Chapel (Fort Jackson - South Carolina), Sacred Heart Church (Anniston Alabama), Our Lady of the Angels (Cape May), St. Nicholas of Tolentine (Atlantic City), St. James (Ventnor), Chaplain Burdette Tomlin Hospital (Cape May), Chaplain Atlantic City Medical Center (Atlantic City)","Year Born":1936,"Year Ordained":1960,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Smith","First_name_MI":"John E.","Diocese":"Camden","Churches":"St. Bernadette (Northfield), St. Lawrence (Lindenwold), O. L. of Mt. Carmel (Berlin), St. Cecelia (Pennsauken), St. Michael (Atlantic City), Incarnation (Mantua), Holy Spirit High School (Absecon), St. Nicholas Grammar School (Atlantic City)","Year Born":1943,"Year Ordained":1969,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Smith","First_name_MI":"Walter","Diocese":"Camden","Churches":"St. Casimir (Woodbine), Our Lady of the Angels (Cape May), St. Luke (Stratford), Immaculate Conception (Camden), Immaculate Conception (Bridgeton), St. Mary (Williamstown), Most Holy Redeemer (Westville Grove), St. Anthony of Padua (Hammonton), St. Ann (Wildwood), St. Mary (Gloucester), Sacred Heart (Vineland), St. Michael (Gibbstown), St. Patrick (Woodbury), Chaplain Cooper University Hospital (Camden), Chaplain Newcomb Hospital (Vineland), Chaplain Underwood Memorial Hospital (Woodbury)","Year Born":1940,"Year Ordained":1968,"Victim Number":"","Status":"Deceased"},{"Last_name":"St. Germain","First_name_MI":"Antoine","Diocese":"Camden","Churches":"Corpus Christi (Carneys Point), Our Lady of Grace (Somerdale), St. Frances de Sales (Barrington), St. Martin de Porres (Hammonton), St. Joseph High School (Hammonton), Incarnation (Mantua), St. Augustine (Ocean City), St. John (Paulsboro), St. Stephen (Pennsauken)","Year Born":1945,"Year Ordained":1976,"Victim Number":"","Status":"Deceased"},{"Last_name":"Sullivan","First_name_MI":"Brendan V.","Diocese":"Camden","Churches":"St. Theresa (Runnemede), Queen of Apostles (Runnemede), St. Maurice (Brooklawn), Villanova University, St. Joan of Arc (Camden), Camden Catholic High School (Cherry Hill), Blessed Sacrement (Margate), Holy Spirit High School (Absecon), St. Elizabeth Ann Seton (Absecon), Our Lady of Grace (Somerdale), Assumption (Atco), St. Patrick (Woodbury), St. James (Ventnor)","Year Born":1934,"Year Ordained":1960,"Victim Number":"","Status":"Deceased"},{"Last_name":"Titmas","First_name_MI":"William D.","Diocese":"Camden","Churches":"St. Thomas (Brigantine), St. Margaret (Woodbury Heights), St. James (Ventnor), St. Joseph (South Camden), St. Stephen (Pennsauken), St. Peter (Merchantville), O.L. Star of the Sea (Cape May), Assumption (Pomona), St. Mary (Salem), St. Joseph (Sea Isle City), West Jersey Hospital - Chaplain (Camden)","Year Born":1934,"Year Ordained":1963,"Victim Number":"","Status":"Deceased"},{"Last_name":"Vasapolli","First_name_MI":"Alfred J.","Diocese":"Camden","Churches":"Christ the King (Haddonfield), St. Aloysius (Oaklyn), Camden Catholic High School (Cherry Hill), St. Joseph (South Camden), O.L. of the Lakes (Collings Lakes), St. Peter Celestine (Cherry Hill), St. Rose of Lima (Haddon Heights), Transfiguration (West Collingswood)","Year Born":1947,"Year Ordained":1973,"Victim Number":"","Status":"Removed"},{"Last_name":"Weaver","First_name_MI":"Patrick","Diocese":"Camden","Churches":"Our Lady of Victories (Landisville), St. John (Collingswood), Corpus Chrisi (Carney's Point), St. John (Paulsboro), St. Mary's (Cherry Hill), St. Joan of Arc (Camden)","Year Born":1935,"Year Ordained":1963,"Victim Number":"","Status":"Deceased"},{"Last_name":"Banko","First_name_MI":"John","Diocese":"Metuchen","Churches":"St. Pius X High School (Piscataway), St. Charles Borromeo (Montgomery Twp.), St. Edward (Milford), Mary Mother of God (Hillsborough)","Year Born":1946,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Casey","First_name_MI":"John","Diocese":"Metuchen","Churches":"St. Philip and St. James (Phillipsburg), St. Peter the Apostle (New Brunswick), Cathedral of St. Francis of Assisi (Metuchen), St. Joseph (North Plainfield)","Year Born":1958,"Year Ordained":1984,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Cashman","First_name_MI":"Michael","Diocese":"Metuchen","Churches":"Immaculate Conception (Spotswood), Our Lady of Peace (North Brunswick), Sacred Heart (New Brunswick), St. James (Woodbridge","Year Born":1950,"Year Ordained":1975,"Victim Number":"Multiple","Status":"Removed"},{"Last_name":"Dolak","First_name_MI":"Mark","Diocese":"Metuchen","Churches":"Our Lady of Peace (Fords), Cathedral of St. Francis of Assisi (Metuchen), St. Thomas the Apostle (Old Bridge), St. John the Evangelist (Dunellen), St. Matthias (Somerset), St. Catherine of Siena (Pittstown","Year Born":1952,"Year Ordained":1979,"Victim Number":"Multiple","Status":"Removed"},{"Last_name":"Ganley","First_name_MI":"Thomas","Diocese":"Metuchen","Churches":"St. Ann (Raritan), St. Cecilia (Monmouth Junction), St. Matthew (Edison), Immaculate Conception (Spotswood), St. Cecelia (Iselin), Our Lady of Fatima (Piscataway), Sacred Heart (South Plainfield), St. Ann (Raritan), St. Philip and St. James (Phillipsburg","Year Born":1955,"Year Ordained":1985,"Victim Number":"One","Status":"Removed"},{"Last_name":"Giordano","First_name_MI":"John","Diocese":"Metuchen","Churches":"St. Luke (North Plainfield","Year Born":1941,"Year Ordained":1967,"Victim Number":"Multiple","Status":"Removed"},{"Last_name":"Kramarz","First_name_MI":"Anthony","Diocese":"Metuchen","Churches":"St. Stanislaus Kostka (Sayreville)","Year Born":1925,"Year Ordained":1950,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Kuffner","First_name_MI":"Patrick","Diocese":"Metuchen","Churches":"Queenship of Mary (Plainsboro), St. Bartholomew (East Brunswick), Our Lady of Mount Virgin (Middlesex","Year Born":1947,"Year Ordained":2002,"Victim Number":"Multiple","Status":"Removed"},{"Last_name":"Littleton","First_name_MI":"Gregory","Diocese":"Metuchen","Churches":"St. Philip and St. James (Phillipsburg), Our Lady of Victories (Sayreville), Our Lady of Mount Virgin (Middlesex), St. Elizabeth-St. Brigid (Far Hills-Peapack","Year Born":1961,"Year Ordained":1990,"Victim Number":"Multiple","Status":"Removed"},{"Last_name":"Rossi","First_name_MI":"Dann","Diocese":"Metuchen","Churches":"St. Luke (North Plainfield)","Year Born":1947,"Year Ordained":"1982 (Ordained to the Diaconate)","Victim Number":"One","Status":"Deceased"},{"Last_name":"Santillo","First_name_MI":"Michael","Diocese":"Metuchen","Churches":"St. Joseph (Bound Brook), Our Lady of Lourdes (Whitehouse Station), St. John Vianney (Colonia), St. Jude (Blairstown), St. Mary (Perth Amboy), St. Joseph (Washington","Year Born":1949,"Year Ordained":1975,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Alcamo","First_name_MI":"Robert","Diocese":"Newark","Churches":"St. Raphael (Livingston), Assumption (Roselle Park)","Year Born":1955,"Year Ordained":1980,"Victim Number":"One","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Batista","First_name_MI":"Jorge","Diocese":"Newark","Churches":"St. Paul of the Cross (Jersey City), Blessed Sacrament (East Orange), St. Nicholas (Jersey City), St. Augustine (Union City), St. Anthony of Padua (Union City), Our Lady of the Most Holy Rosary/St.Michael (Elizabeth), St. Aloysius (Newark), St. Joseph of the Palisades (West New York)","Year Born":1938,"Year Ordained":1983,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Benedetto","First_name_MI":"James T.","Diocese":"Newark","Churches":"St. Antonius (Newark), St. Catherine of Siena (Cedar Grove), St. Michael (Cranford), Our Lady of Lourdes (Mountainside), Assumption (Emerson)","Year Born":1944,"Year Ordained":1970,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Bergeur","First_name_MI":"John X.","Diocese":"Newark","Churches":"Our Lady of the Visitation (Paramus), EMS (Newark), Our Lady of the Most Holy Rosary/St. Michael (Elizabeth), St. Anthony (East Newark)","Year Born":1918,"Year Ordained":1945,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Bonelli","First_name_MI":"Vincent","Diocese":"Newark","Churches":"Chaplain - K of C (Caldwell), Religion Faculty of East Orange Catholic HS, Notre Dame (North Caldwell), St. Francis Xavier Church (Newark)","Year Born":1929,"Year Ordained":1956,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Bouton","First_name_MI":"John C.","Diocese":"Newark","Churches":"St. Aloysius (Caldwell), Our Lady of Peace (New Providence), Holy Rosary (Edgewater), Immaculate Conception (Secaucus)","Year Born":1922,"Year Ordained":1949,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Campanlonga","First_name_MI":"Michael","Diocese":"Newark","Churches":"Immaculate Conception (Newark), Fairleigh Dickinson University (Rutherford), Stevens Institute of Technology (Hoboken), Holy Rosary Academy (Union City), Assumption (Emerson), St. Anthony (Northvale, St. Philomena (Livingston)","Year Born":1936,"Year Ordained":1962,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Capparelli","First_name_MI":"John","Diocese":"Newark","Churches":"Our Lady of Fatima (North Bergen), Oratory Prep (Summit), Holy Trinity (Westfield), St. Theresa (Kenilworth), Temporary Chaplain - Valley Hospital (Ridgewood)","Year Born":1948,"Year Ordained":1980,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Carey","First_name_MI":"James A","Diocese":"Newark","Churches":"Christ the King (Jersey City), US Army, Seton Hall University (South Orange), Chaplain, St. Elizabeth Hospital (Elizabeth), Chaplain, St. Mary Hospital, Immaculate Conception (Montclair), Oratory Prep (Summit), Holy Trinity (Westfield), St. Michael Church (Jersey City)","Year Born":1906,"Year Ordained":1936,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Chabak","First_name_MI":"Robert","Diocese":"Newark","Churches":"Holy Family (Nutley), St. Valentine (Bloomfield), Ss. Peter and Paul (Hoboken), St. Theresa (Kenilworth), Christ the King (Hillside), St. Mary of the Assumption (Elizabeth)","Year Born":1946,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Cheplic","First_name_MI":"Peter","Diocese":"Newark","Churches":"St. Henry (Bayonne), St. Lawrence (Weehawken), St. Aloysius (Jersey City), Holy Spirit/Our Lady Help of Christians (East Orange)","Year Born":1946,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Cocozza","First_name_MI":"Dennis","Diocese":"Newark","Churches":"Assumption (Roselle Park), St. Anthony of Padua (Newark), St. Henry (Bayonne), St. Mary (Dumont), Sacred Heart (Rochelle Park), Paramus Catholic HS (Paramus), St. Cassian (Upper Montclair)","Year Born":1949,"Year Ordained":1975,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Coutinho","First_name_MI":"Absalom","Diocese":"Newark","Churches":"St. Nicholas (Jersey City)","Year Born":1944,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Crespo","First_name_MI":"Arturo","Diocese":"Newark","Churches":"St. Teresa of Avila (Summit), St. Bridget Resurrection (Jersey City)","Year Born":1961,"Year Ordained":1994,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"DeFrias","First_name_MI":"Hadmels R.","Diocese":"Newark","Churches":"St. Mary (Elizabeth)","Year Born":1971,"Year Ordained":1999,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"DiPeri","First_name_MI":"Joseph","Diocese":"Newark","Churches":"Out Lady of Mt. Virgin (Garfield), St. Cecilia School (Englewood), Oratory Prep (Summit), St. Lucy (Newark), St. Anthony of Padua (Newark), Our Lady of Mt. Carmel (Jersey City)","Year Born":1930,"Year Ordained":1956,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Donohue","First_name_MI":"John J.","Diocese":"Newark","Churches":"Chaplain Clara Maas Medical Center (Belleville), St. Valentine (Bloomfield), Immaculate Heart of Mary/St. Patrick (Elizabeth)","Year Born":1947,"Year Ordained":1973,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Duffy","First_name_MI":"Thomas F.","Diocese":"Newark","Churches":"Our Lady of Peace (North Arlington), St. Michael's (Palisades Park)","Year Born":1906,"Year Ordained":1933,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Eilert","First_name_MI":"Edward","Diocese":"Newark","Churches":"St. Philomena (Livingston), St. Vincent de Paul (Bayonne), Our Lady of Lourdes (Mountainside), St. John the Apostle (Linden)","Year Born":1938,"Year Ordained":1964,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Ernst","First_name_MI":"David","Diocese":"Newark","Churches":"St. Elizabeth (Wyckoff), Ss. Joseph and Michael (Union City), Holy Spirit/Our Lady Help of Christians (East Orange)","Year Born":1926,"Year Ordained":1954,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Fagan","First_name_MI":"Joseph P.","Diocese":"Newark","Churches":"Little Flower (Berkeley Heights), St. Charles Borromeo (Newark), Our Lady Of Grace/St. Joseph (Hoboken), Christ the King (Jersey City)","Year Born":1911,"Year Ordained":1937,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Flanagan","First_name_MI":"John","Diocese":"Newark","Churches":"St. Bernard (Plainfield), Chaplain - St. Francis Hospital (Jersey City), Holy Rosary (Edgewater), Holy Trinity (Westfield), Our Lady of All Souls (East Orange)","Year Born":1913,"Year Ordained":1941,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Fugee","First_name_MI":"Michael C.","Diocese":"Newark","Churches":"St. Antoninus (Newark), Sacred Heart (Rochelle Park), Chaplain - St. Michael Medical Center (Newark), St. Elizabeth (Wyckoff), St. Rose of Lima (Short Hills)","Year Born":1961,"Year Ordained":1994,"Victim Number":"One","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Gadek","First_name_MI":"Lawrence","Diocese":"Newark","Churches":"St. Catherine (Hillside), Assumption (Jersey City)","Year Born":1930,"Year Ordained":1955,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Galdon","First_name_MI":"Richard","Diocese":"Newark","Churches":"Our Lady of Good Counsel (Newark)","Year Born":1932,"Year Ordained":1959,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Gallo-Espinoza","First_name_MI":"Manuel","Diocese":"Newark","Churches":"St. Mary (Plainfield)","Year Born":1963,"Year Ordained":1998,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Giblin","First_name_MI":"William","Diocese":"Newark","Churches":"St. Joseph (E. Orange), St. Peter the Apostle (River Edge), Seton Hall Prep (South Orange), St. Mary (Rutherford), Queen of Peace (N. Arlington)","Year Born":1932,"Year Ordained":1959,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Gibney","First_name_MI":"Robert","Diocese":"Newark","Churches":"Our Lady of Mt. Carmel (Ridgewood), Chaplain - Overlook Hospital, St. Catherine of Siena (Cedar Grove), St. Mary (Dumont), Military Chaplain, Sacred Heart (Vailsburg), Immaculate Conception Seminary (South Orange), St. Cecilia (Kearny)","Year Born":1927,"Year Ordained":1954,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Giella","First_name_MI":"Augustine","Diocese":"Newark","Churches":"St. Catherine (Glen Rock), Epiphany (Cliffside Park), Our Lady Of Sorrows (Jersey City), Holy Trinity (Hackensack), St. Joseph's Church (Hanover), St. John the Evangelist (Enhaut)","Year Born":1920,"Year Ordained":1950,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Guglielmo","First_name_MI":"Alan","Diocese":"Newark","Churches":"Immaculate Conception (Secaucus), St. Anthony of Padua (Newark), Chaplain - Columbus Hospital (Newark One), Chaplain - St. Michael Medical Center (Newark), St. Valentine (Bloomfield), Chaplain - Mountainside Hospital (Montclair), Chaplain - Clara Maas Hospital (Belleville), Sacred Heart (Lyndhurst), Chaplain - St. Mary Hospital (Hoboken), St. Mary (Jersey City), Spiritual DIrector - CYO Hudson (Jersey City), Chaplain - Hudson Catholic Regional HS (Jersey City), St. Aedan's the St. Peter's University Church (Jersey City), St. Michael (Union), Roselle Catholic (Roselle), Mother Seton Regional High School (Clark), St. Helen (Westfield), Assumption (Roselle Park)","Year Born":1942,"Year Ordained":1968,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Gugliotta","First_name_MI":"Kevin","Diocese":"Newark","Churches":"Holy Spirit (Union), Immaculate Conception (Mahwah), Ramapo College (Mahwah), St. Bartholomew (Scotch Plains), St. Joseph (West Orange), St. Elizabeth (Wyckoff), St. Rose of Lima (Short Hills)","Year Born":1962,"Year Ordained":1996,"Victim Number":"Multiple (Child Pornography)","Status":"Permanently removed from ministry"},{"Last_name":"Hartling","First_name_MI":"Charles","Diocese":"Newark","Churches":"St. Mary (Rutherford), St. Elizabeth (Wyckoff), Holy Spirit (Union)","Year Born":1941,"Year Ordained":1979,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Heyndricks","First_name_MI":"Eugene","Diocese":"Newark","Churches":"St. John Nepomucene (Guttenberg), St. John the Baptist (Fairview), Our Lady of Mercy (Park Ridge), Our Lady of the Lake (Verona), Our Lady of Mt. Carmel (Ridgewood)","Year Born":1942,"Year Ordained":1981,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Howard (Sita)","First_name_MI":"Gerald C.","Diocese":"Newark","Churches":"St. Aloysius (Jersey City)","Year Born":1945,"Year Ordained":1976,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Hudson","First_name_MI":"Charles","Diocese":"Newark","Churches":"Center for Hope Hospice (Union), St. Elizabeth Hospital (Elizabeth), Holy Name Hospital (Teaneck), Our Lady of Mercy (Park Ridge)","Year Born":1935,"Year Ordained":1962,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Komar","First_name_MI":"John","Diocese":"Newark","Churches":"St. Matthew (Ridgefield), Englewood Hospital (Englewood), St. Joseph (Bayonne), Valley Hospital (Ridgewood), St. Margaret of Corona (Little Ferry), Our Lady of Fatima (North Bergen), Jersey City Medical Center (Jersey City), St. Philip the Apostle (Saddle Brook)","Year Born":1937,"Year Ordained":1964,"Victim Number":"Multiple (Child Pornography)","Status":"Deceased"},{"Last_name":"Kortina","First_name_MI":"Kevin","Diocese":"Newark","Churches":"Sacred Heart Cathedral (Newark), Our Lady of Lourdes (West Orange), Union Catholic Regional High School (Scotch Plains), DeLaSalle HS (Concord, CA), St. Francis DeSales Church (San Bernadino, CA)","Year Born":1944,"Year Ordained":1970,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Laferrera","First_name_MI":"John","Diocese":"Newark","Churches":"St. Philomena (Livingston), St. Aloysius (Caldwell), St. Francis Xavier (Newark), Immaculate Conception (Newark)","Year Born":1947,"Year Ordained":1973,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Maione","First_name_MI":"Francis T.","Diocese":"Newark","Churches":"St. Lucy (Newark), Catholic Community Services (Newark), Blessed Sacrement/St. Charles Borromeo (Newark), American College (Louvain), St. Pius X (Old Tappan), Holy Family (Union City), Immaculate Conception Seminary (Mahwah), Our Lady of Grace/St. Joseph (Hoboken), Our Lady of the Visitation (Paramus)","Year Born":1939,"Year Ordained":1965,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Marotta","First_name_MI":"Robert","Diocese":"Newark","Churches":"Our Lady of Mt. Carmel (Jersey City), Our Lady of Mt. Carmel (Lyndhurst), Our Lady of the Rosary (Newark), Our Lady of Mt. Carmel (Newark), St. John the Baptist (Jersey City), Our Lady of Libera (West New York), Immaculate Conception (Secaucus),  Our Lady of Victories (Jersey City), St. Cecilia (Kearny)","Year Born":1934,"Year Ordained":1963,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Martin","First_name_MI":"Kenneth","Diocese":"Newark","Churches":"Pope John Paul II Pavilion (Orange), St. Michael Medical Center (Newark), Holy Name of Jesus (East Orange), St. Andrew (Bayonne)","Year Born":1949,"Year Ordained":1977,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"McAulay","First_name_MI":"John R.","Diocese":"Newark","Churches":"St. Mary of the Assumption (Elizabeth)","Year Born":"","Year Ordained":1975,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"McCann","First_name_MI":"William","Diocese":"Newark","Churches":"St. Aloysius (Jersey City), Holy Trinity (Westfield), Ss. Peter and Paul (Hoboken), Army Chaplain, Our Lady Help of Christians (East Orange), St. Francis (Ridgefield Park), St. Philomena (Livingston)","Year Born":1899,"Year Ordained":1925,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"McCarrick","First_name_MI":"Theodore","Diocese":"Newark","Churches":"Archbishop Theodore McCarrick has been included on the list based on the findings of the Archdiocese of New York that allegations of abuse of a minor against then Father McCarrick were credible and substantiated.","Year Born":1930,"Year Ordained":1958,"Victim Number":"","Status":"Permanently removed from ministry"},{"Last_name":"Medina","First_name_MI":"Daniel","Diocese":"Newark","Churches":"Holy Trinity/Epiphany (Newark), Blessed Sacrament/St. Charles Borromeo (Newark), St. Aloysius (Jersey City), Blessed Sacrament (Elizabeth)","Year Born":1967,"Year Ordained":1998,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Mieliwocki","First_name_MI":"Richard","Diocese":"Newark","Churches":"Roselle Catholic, St. Joseph the Carpenter (Roselle), Most Holy Name (Garfield), Our Lady of Sorrows (South Orange), Holy Trinity (Westfield), Nativity (Midland Park)","Year Born":1946,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Permanently removed from ministry/Laicized"},{"Last_name":"Morel","First_name_MI":"John","Diocese":"Newark","Churches":"St. Aloysius (Newark), St. Lucy (Newark), St. Michael (Jersey City), Hackensack Hospital (Hackensack), St. Anthony of Padua (Newark), Holy Family (Union City), Nativity (Midland Park), St. Andrew (Westwood), Our Lady of the Assumption (Bayonne)","Year Born":1929,"Year Ordained":1955,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Morel","First_name_MI":"Robert","Diocese":"Newark","Churches":"Our Lady of the Visitation (Paramus), Catholic Community Services (Newark), St. Joseph (Jersey City), St. Peter the Apostle (River Edge), Our Lady of the Blessed Sacrament (Roseland)","Year Born":1943,"Year Ordained":1969,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Mousley","First_name_MI":"Thomas","Diocese":"Newark","Churches":"Boys Town (Kearny), St. Joseph (Maplewood)","Year Born":"","Year Ordained":1976,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Nickas","First_name_MI":"John","Diocese":"Newark","Churches":"St. Peter Claver (Montclair), St. Rocco Community Outreach Center (Newark), St. Rocco School (Newark), St. Rocco Parish (Newark), Chaplain - Essex County Prison (Newark), St. Patrick Pro-Cathedral (Newark), Most Blessed Sacrament (Franklin Lakes)","Year Born":1940,"Year Ordained":1966,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"O'Brien","First_name_MI":"Michael","Diocese":"Newark","Churches":"Our Lady of Sorrows (Kearny), Our Lady of Mt. Carmel (Lyndhurst), Our Lady of Mt. Virgin (Garfield), St. Rose of Lima (Short Hills), Our Lady of Mt. Carmel (Jersey City), St. Anthony of Padua (Union City)","Year Born":1938,"Year Ordained":1977,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Reilly","First_name_MI":"Thomas H.","Diocese":"Newark","Churches":"St. Mary (Paterson), Sacred Heart (Newark), Chaplain - USS South Dakota, District Chaplain, Holy Name of Jesus (East Orange)","Year Born":1903,"Year Ordained":1929,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Rengifo","First_name_MI":"Jesus Orlando","Diocese":"Newark","Churches":"St. Joseph of the Palisades (West New York), Holy Trinity (Hackensack), St. Paul of the Cross (Jersey City)","Year Born":1958,"Year Ordained":1984,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Rice","First_name_MI":"Joseph","Diocese":"Newark","Churches":"Chaplain - Bergen Regional Medical Center (Paramus), Chaplain - St. Michael Medical Center (Newark), St. John the Apostle (Linden), St. Mary (Jersey City)","Year Born":1940,"Year Ordained":1977,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Ruane","First_name_MI":"Gerald","Diocese":"Newark","Churches":"Holy Trinity (Westfield), Sacred Heart Institute (West Caldwell), Chaplain - Caldwell College (Caldwell), Our Lady of Lourdes (West Orange)","Year Born":1934,"Year Ordained":1960,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Salazar","First_name_MI":"Mario","Diocese":"Newark","Churches":"Chaplain - Bergen Regional Medical Center (Paramus), Carmelite Chapel Of St. Therese (Paramus), St. Joseph of the Palisades (West New York), St. Mary (Jersey City)","Year Born":1952,"Year Ordained":1979,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Stanford","First_name_MI":"Thomas","Diocese":"Newark","Churches":"Our Lady of Perpetual Help (Oakland), St. Margaret of Cortona (Little Ferry), St. Luke (Ho-Ho-Kus)","Year Born":"","Year Ordained":1979,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Stanley","First_name_MI":"Edward","Diocese":"Newark","Churches":"Sacred Heart (Bloomfield), St. John (Bergenfield), Archdiocesan Director CYO, St. Mary (Jersey City), St. Patrick (Elizabeth)","Year Born":1903,"Year Ordained":1931,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Stauffer","First_name_MI":"Robert","Diocese":"Newark","Churches":"St. Francis (Ridgefield Park), Assumption (Emerson), St. Mary (Nutley), Our Lady of Assumption (Bayonne), St. Rose of Lima (Short Hills)","Year Born":1936,"Year Ordained":1964,"Victim Number":"One","Status":"Permanently removed from ministry"},{"Last_name":"Sudol","First_name_MI":"Gerald","Diocese":"Newark","Churches":"Holy Family (Nutley), St. Francis of Assisi (Ridgefield Park), St. Ann-Polish (Jersey City), Chaplain - St. Francis Community Center (Jersey City), Holy Rosary (Jersey City), Mount St. Andrew Villa (Paramus), Padre Pio Friary (Hoboken)","Year Born":1954,"Year Ordained":1980,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Svec","First_name_MI":"Robert","Diocese":"Newark","Churches":"St. Henry (Bayonne), Our Lady of Mt. Carmel (Jersey City), St. Mary - Star of the Sea (Bayonne), St. John the Baptist (Jersey City), IHM/St. Patrick (Elizabeth), Our Lady of Mt. Carmel (Montclair), St. Vincent De Paul (Bayonne), St. Columba (Newark), St. Charles Borromeo (Newark)","Year Born":1928,"Year Ordained":1954,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Walters","First_name_MI":"Michael M.","Diocese":"Newark","Churches":"Our Lady Of Sorrows (S. Orange), Our Lady of Mt. Carmel (Orange), Holy Spirit/Our Lady Help of Christians (East Orange), St. Matthew (Ridgefield), St. John Nepomucene (Gutttenberg), Sacred Heart (Haworth), Our Lady of All Souls (East Orange), St. Cassian (Upper Montclair)","Year Born":1955,"Year Ordained":1981,"Victim Number":"Multiple","Status":"Permanently removed from ministry"},{"Last_name":"Zasacki","First_name_MI":"Robert","Diocese":"Newark","Churches":"St. Joseph (West Orange), St. Francis De Sales (Lodi), St. Leo's (Irvington), Our Lady of Mt. Carmel (Ridgewood), St. Brigid (North Bergen)","Year Born":1940,"Year Ordained":1967,"Victim Number":"One","Status":"Deceased"},{"Last_name":"Alonso","First_name_MI":"Jose","Diocese":"Paterson","Churches":"St. Agnes (Paterson), St. John Cathedral (Paterson), Our Lady of Victories (Paterson)","Year Born":1940,"Year Ordained":1968,"Victim Number":"Multiple","Status":"Deceased, 2003"},{"Last_name":"Bradley","First_name_MI":"Charles","Diocese":"Paterson","Churches":"St. John Cathedral (Paterson), Neumann House (Wayne), Paterson Catholic High School (Paterson), Bayley-Ellward High School (Paterson), Our Lady of Consolation (Wayne), DePaul Catholic High School (Wayne)","Year Born":1942,"Year Ordained":1968,"Victim Number":"One","Status":"Removed 1995, Deceased"},{"Last_name":"Costigan","First_name_MI":"George","Diocese":"Paterson","Churches":"Dover General Hospital (Dover)","Year Born":1926,"Year Ordained":1974,"Victim Number":"One","Status":"Removed 1994, Deceased"},{"Last_name":"Coutinho","First_name_MI":"Absalom","Diocese":"Paterson","Churches":"St. Judge (Budd Lake), Our Lady of Mt. Carmet (Boonton), Immaculate Heart of Mary (Wayne), Annunciation (Wayne)","Year Born":1944,"Year Ordained":1972,"Victim Number":"Multiple","Status":"Removed from ministry April 20 2002"},{"Last_name":"Cranmer","First_name_MI":"William","Diocese":"Paterson","Churches":"Our Lady of the Lake (Sparta), Our Lady of Mt. Carmel (Boonton), St. Joseph Hospital (Paterson)","Year Born":1951,"Year Ordained":1977,"Victim Number":"Multiple","Status":"Removed from ministry June 2002"},{"Last_name":"Dennehy","First_name_MI":"Francis","Diocese":"Paterson","Churches":"Our Lady of Victories (Paterson), U.S. Navy, Assumption (Morristown), St. Joseph Hospital (Paterson), St. Nicholas (Passaic), St. Vincent DePaul (Stirling), St. Therese (Paterson), St. Pius X (Montville), St. Thomas (Ogdensburg), St. Christopher (Parsippany), Immaculate Conception (Franklin), Our Lady Queen of Peace (Hawaii), Wayne General Hospital (Wayne), Chilton Hospital (Wayne)","Year Born":1925,"Year Ordained":1950,"Victim Number":"Mutiple","Status":"Deceased 1995"},{"Last_name":"Derricks","First_name_MI":"John","Diocese":"Paterson","Churches":"St. Joseph (Paterson), Holy Spirit (Pequannock), Assumption (Morristown)","Year Born":1916,"Year Ordained":1941,"Victim Number":"One","Status":"Deceased 2010"},{"Last_name":"Durka","First_name_MI":"Stanislaus","Diocese":"Paterson","Churches":"St. Virgil (Morris Plains), St. Joseph (Passaic), St. Stephen (Paterson), St. Joseph (Paterson), St. Thomas (Ogdensburg)","Year Born":1914,"Year Ordained":1939,"Victim Number":"One","Status":"Deceased 1983"},{"Last_name":"Erwin","First_name_MI":"Patrick","Diocese":"Paterson","Churches":"St. Gerard Majella (Paterson), St. Joseph (Paterson), Catholic Community Center, Our Lady of Victories (Paterson), Office of Pastoral Planning (Paterson), Service outside the Diocese, Our Lady of Fatima (Highland Lakes), St. Mary (Paterson)","Year Born":1943,"Year Ordained":1967,"Victim Number":"Mutiple","Status":"Removed from ministry November 15 2004, Deceased"},{"Last_name":"Guzman","First_name_MI":"Carlos","Diocese":"Paterson","Churches":"St. John Cathedral (Paterson)","Year Born":1946,"Year Ordained":1981,"Victim Number":"Mutiple","Status":"Removed from ministry October 20 1981"},{"Last_name":"Hanley","First_name_MI":"James","Diocese":"Paterson","Churches":"St. Andrew (Clifton), Our Lady of Good Counsel (Pompton Plains), St. Christopher (Parsippany), St. Joseph (Mendham), Immaculate Heart of Mary (Wayne), Diocese of Albany (Albany, NY)","Year Born":1936,"Year Ordained":1962,"Victim Number":"Multiple","Status":"Removed from ministry February 1986, Laicized February 7 2003"},{"Last_name":"Heekin","First_name_MI":"John","Diocese":"Paterson","Churches":"St. Mary (Paterson), St. Pius X (Montville), St. Therese (Paterson), Bayley-Ellard High School (Madison), Pope Pius XII High School (Passaic), Immaculate Conception (Franklin), Holy Cross (Wayne)","Year Born":1937,"Year Ordained":1963,"Victim Number":"Multiple","Status":"Removed from ministry November 17 2011, Deceased"},{"Last_name":"Lopez","First_name_MI":"Jose","Diocese":"Paterson","Churches":"St. Mary (Passaic), St. Nicholas (Passaic)","Year Born":1979,"Year Ordained":2011,"Victim Number":"One","Status":"Removed from ministry July 9 2013"},{"Last_name":"McBride","First_name_MI":"Peter","Diocese":"Paterson","Churches":"St. Virgil (Morris Plains), St. Clare (Clifton), St. Peter (Parsippany), St. Andrew (Clifton)","Year Born":1935,"Year Ordained":1960,"Victim Number":"Multiple","Status":"Removed from ministry October 1 1994"},{"Last_name":"Mockus","First_name_MI":"William","Diocese":"Paterson","Churches":"Our Lady of the Valley (Wayne), Our Lady of Mercy (Whippany)","Year Born":1945,"Year Ordained":1974,"Victim Number":"One","Status":"Removed from ministry 1995, Deceased"},{"Last_name":"Molloy","First_name_MI":"Joseph","Diocese":"Paterson","Churches":"St. Nicholas (Passaic)","Year Born":1927,"Year Ordained":1953,"Victim Number":"Multiple","Status":"Deceased"},{"Last_name":"Nurek","First_name_MI":"Marcin","Diocese":"Paterson","Churches":"St. Catherine of Siena (Mountain Lakes)","Year Born":1979,"Year Ordained":2017,"Victim Number":"One","Status":"Removed from ministry Aug. 3, 2017"},{"Last_name":"Pisarcik","First_name_MI":"John","Diocese":"Paterson","Churches":"Morris Catholic High School (Denville), St. Pius X (Montville), St. Cecelia (Rockaway), Neumann Prep (Wayne), Christ the King Seminary (E. Aurora, NY), Bayley-Ellard High School (Madison), St. Francis Health Resort Complex (Denville), Sacred Heart (Rockaway)","Year Born":1944,"Year Ordained":1970,"Victim Number":"Multiple","Status":"Removed from ministry Oct. 8, 1991"},{"Last_name":"Pruschowitz","First_name_MI":"Walter","Diocese":"Paterson","Churches":"Holy Trinity (Passaic), Immaculate Conception (Franklin)","Year Born":1928,"Year Ordained":1961,"Victim Number":"Multiple","Status":"Deceased Feb. 21, 2004"},{"Last_name":"Scott","First_name_MI":"James","Diocese":"Paterson","Churches":"Paul VI High School (Clifton), Our Lady Star of the Sea (Lake Hopatcong), Pope John High School (Sparta), DePaul High School (Wayne)","Year Born":1948,"Year Ordained":1974,"Victim Number":"One","Status":"Removed from ministry 1995"},{"Last_name":"Smith","First_name_MI":"James A.D.","Diocese":"Paterson","Churches":"St. Anthony (Hawthorne), Holy Family (Florham Park), St. Joseph Hospital- Chaplain, St. Monica (Sussex), Our Lady of Victories (Paterson), St. Monica (Sussex), St. Christopher (Parsippany), St. Rose of Lima (East Hanover), St. Patrick (Chatham), St. George (Paterson), St. Therese (Succasunna)","Year Born":1931,"Year Ordained":1956,"Victim Number":"Multiple","Status":"Deceased Jan. 27, 2015"},{"Last_name":"Sodano","First_name_MI":"Ralph","Diocese":"Paterson","Churches":"St. Brendan (Clifton), Diocesan Director of Catholic Scouting, Pope Pius XII High School (Passaic), St. Rose of Lima (East Hanover), United States Navy Chaplain, Sacred Heart (Dover), Our Lady of the Mountain (Long Valley)","Year Born":1941,"Year Ordained":1967,"Victim Number":"Multiple","Status":"Removed from ministry April 20, 2002, Deceased Oct. 22, 2008"},{"Last_name":"Stepien","First_name_MI":"Allen","Diocese":"Paterson","Churches":"St. Rose of Lima (East Hanover), Assumption (Morristown), St. Anthony (Hawthorne), St. Philip (Clifton), St. Mark (Long Valley)","Year Born":1936,"Year Ordained":1965,"Victim Number":"Multiple","Status":"Removed from ministry April 20, 2002"},{"Last_name":"Sutton","First_name_MI":"John","Diocese":"Paterson","Churches":"St. Andrew (Clifton), St. Agnes (Paterson), St. Joseph Hospital, Our Lady of Mt. Carmel (Swartswood), St. Patrick (Chatham), Excardinated/Incardinated Diocese of Palm Beach","Year Born":1943,"Year Ordained":1970,"Victim Number":"One","Status":"Deceased 2000"},{"Last_name":"Tully","First_name_MI":"Ronald","Diocese":"Paterson","Churches":"Pope Pius High School (Passaic), St. Rose of Lima (East Hanover), Immaculate Conception (Franklin), St. Joseph (Lincoln Park), Sacred Heart (Dover)","Year Born":1937,"Year Ordained":1966,"Victim Number":"Multiple","Status":"Removed from ministry May 12, 2004, Laicized Jan. 22, 2016, Deceased Nov. 29, 2018"},{"Last_name":"Wall","First_name_MI":"John","Diocese":"Paterson","Churches":"St. Virgil (Morris Plains), St. Mary Hospital (Passaic), Our Lady Queen of Peace (Branchville)","Year Born":1929,"Year Ordained":1954,"Victim Number":"One","Status":"Deceased 1983"},{"Last_name":"White","First_name_MI":"Gregory","Diocese":"Paterson","Churches":"Blessed Kateri (Sparta), St. Anthony (Hawthorne)","Year Born":1969,"Year Ordained":1996,"Victim Number":"One","Status":"Deceased May 10, 2002"},{"Last_name":"Winston","First_name_MI":"William","Diocese":"Paterson","Churches":"Corpus Christi (Chatham), St. Patrick (Chatham), Assumption (Morristown), St. Virgil (Morris Plains)","Year Born":1954,"Year Ordained":1986,"Victim Number":"One","Status":"Removed from ministry Nov. 4, 2004, Laicized Aug. 2007"},{"Last_name":"Apura","First_name_MI":"Romanilo S.","Diocese":"Trenton","Churches":"St. Joachim (Trenton), St. Agnes (Atlantic Highlands), St. Maximillian Kolbe (Toms River), Our Lady of Good Counsel (Moorestown), St. Ann (Keansburg), St. Mary (Trenton), St. Martha (Pt. Pleasant)","Year Born":1947,"Year Ordained":1975,"Victim Number":"","Status":"Removed"},{"Last_name":"Becker","First_name_MI":"Ronald","Diocese":"Trenton","Churches":"Incarnation (Trenton), Holy Angels (Hamilton), Precious Blood (Monmouth Beach), Diocesan Scouting Chaplain, St. Francis (Trenton)","Year Born":1945,"Year Ordained":1973,"Victim Number":"","Status":"Deceased"},{"Last_name":"Brietske","First_name_MI":"Richard","Diocese":"Trenton","Churches":"Our Lady of Perpetual Help (Maple Shade), St. Rose (Belmar), St. Thomas Aquinas High School (Edison), St. George (Titusville), St. Mary (South Amboy), Monmouth College - Chaplain, St. Dominic (Bricktown), Director - Office of Evangelization - Chancery (Lawrenceville), Nativity (Fair Haven), St. Gregory the Great (Hamilton Square), Corpus Christi (Willingboro), Director - Office of Parish Life - Chancery (Lawrenceville), Chancellor of the Diocese of Trenton - Chancery (Lawrenceville)","Year Born":1936,"Year Ordained":1962,"Victim Number":"","Status":"Removed"},{"Last_name":"Brown","First_name_MI":"Gerard","Diocese":"Trenton","Churches":"St. Francis (Metuchen), St. Anthony (Trenton), St. Michael (West End), St. Mary Motherhouse (Cape May), St. Mary of the Lake (Lakewood), Corpus Christi (Willingboro), St. Gregory the Great (Hamilton Square)","Year Born":1936,"Year Ordained":1961,"Victim Number":"","Status":"Deceased"},{"Last_name":"Bruno","First_name_MI":"Francis D.","Diocese":"Trenton","Churches":"Our Lady of Good Counsel (W. Trenton), St. Mary (New Monmouth), St. James (Woodbridge), St. Martha (Pt. Pleasant), St. Joachim (Trenton)","Year Born":1948,"Year Ordained":1974,"Victim Number":"","Status":"Removed"},{"Last_name":"Comito","First_name_MI":"Charles J.","Diocese":"Trenton","Churches":"Saint Catherine (Middletown)","Year Born":1936,"Year Ordained":1998,"Victim Number":"","Status":"Deceased"},{"Last_name":"Dino","First_name_MI":"Benjamin R.","Diocese":"Trenton","Churches":"St. Ann (Keansburg), St. Clement (Matawan)","Year Born":1940,"Year Ordained":1964,"Victim Number":"","Status":"Deceased"},{"Last_name":"Fernandez","First_name_MI":"Manuel R. M.","Diocese":"Trenton","Churches":"Eatontown Mission (Eatontown), Blessed Sacrament (Trenton), St. John the Baptist (Long Branch), Star of the Sea (Long Branch), Jesus the Lord (Keyport), St. Mary (Trenton), St. Joseph (Trenton)","Year Born":1935,"Year Ordained":1959,"Victim Number":"","Status":"Deceased"},{"Last_name":"Frain","First_name_MI":"Thomas J.","Diocese":"Trenton","Churches":"St. Agnes, Atlantic Highlands Holy Angels (Trenton), St. Michael (West End), St. Mark (Sea Girt), Our Lady of Sorrows (Hamilton),  Assistant Superintendent of Catholic Schools at Chancery (Lawrenceville), Sacred Heart (Trenton), St. Ann (Lawrenceville)","Year Born":1921,"Year Ordained":1948,"Victim Number":"","Status":"Deceased"},{"Last_name":"Griffin","First_name_MI":"Gerald J.","Diocese":"Trenton","Churches":"St. Paul (Burlington), St. Mary (Perth Amboy), St. Joseph (North Plainfield), Our Lady, Queen of Peace (Fords), Blessed Sacrament (Trenton), St. Anthony (Red Bank), St. James (Basking Ridge), Holy Cross (Rumson), Sacred Heart (Trenton), St. Peter (New Brunswick), Our Lady of Mercy (Englishtown)","Year Born":1908,"Year Ordained":1938,"Victim Number":"","Status":"Deceased"},{"Last_name":"Hermansen","First_name_MI":"Douglas U.","Diocese":"Trenton","Churches":"St. Paul (Princeton), Chaplain- Notre Dame High School (Lawrenceville), St. Raphael (Hamilton), St. Rose of Lima (Freehold), Chaplain- St. John Vianney High School (Holmdel), St. Pius X (Forked River), Chaplain- Jersey Shore Medical Center (Neptune)","Year Born":1952,"Year Ordained":1979,"Victim Number":"","Status":"Removed From Ministry"},{"Last_name":"Iazetta","First_name_MI":"Frank J.","Diocese":"Trenton","Churches":"Our Lady of Perpetual Help (Maple Shade), St. Paul (Princeton), Faculty- St. Rose High School (Belmar), St. Elizabeth (Avon), Faculty - St. Joseph High School (Metuchen), Sacred Heart (New Brunswick), Faculty- Notre Dame High School (Lawrenceville), Holy Trinity (Long Branch), St. Ann (Browns Mills), Holy Angels (Trenton), St. Veronica (Howell)","Year Born":1942,"Year Ordained":1967,"Victim Number":"","Status":"Deceased"},{"Last_name":"Inghilterra","First_name_MI":"Vincent J.","Diocese":"Trenton","Churches":"St. Philip & St. James (Philipsburg), Chaplain - Trenton State College (Ewing), Holy Spirit (Asbury Park), Holy Cross (Rumson), Chaplain - U.S. Army, Staff - Franciscan University (Steubenville, OH)","Year Born":1942,"Year Ordained":1972,"Victim Number":"","Status":"Removed From Ministry"},{"Last_name":"Janos","First_name_MI":"Francis J. C.","Diocese":"Trenton","Churches":"St. Mary (Perth Amboy), St. Francis (Metuchen), Our Lady of Lourdes (Milltown), St. Philip & St. James (Philipsburg), St. Rose of Lima (Freehold), Chaplain - Middlesex County Boy Scouts, Our Lady of Mercy (Englishtown), St. Matthew the Apostle (Edison), St. Joseph (High Bridge), St. Mary (Barnegat)","Year Born":1917,"Year Ordained":1946,"Victim Number":"","Status":"Deceased"},{"Last_name":"Kelty","First_name_MI":"Leo A.","Diocese":"Trenton","Churches":"Chaplain - Camp Columbus (Bamber Lake), St. Mary (Perth Amboy), Ascension (Bradley Beach), St. Ann (Keansburg), St. Dorothea (Eatontown), St. James (Jamesburg), Corpus Christi (South River), St. Catherine (Holmdel), St. William the Abbot (Howell)","Year Born":1934,"Year Ordained":1960,"Victim Number":"","Status":"Deceased"},{"Last_name":"Magee","First_name_MI":"Patrick F.","Diocese":"Trenton","Churches":"Our Lady of Fatima (Piscataway), Our Lady of Good Counsel (Moorestown), Corpus Christi (Willingboro), St. Martha (Point Pleasant), Sacred Heart (Bay Head)","Year Born":1941,"Year Ordained":1970,"Victim Number":"","Status":"Removed From Ministry"},{"Last_name":"McAlinden","First_name_MI":"Terrance O.","Diocese":"Trenton","Churches":"Our Lady of Victories (Sayreville), Incarnation (Trenton), Chancery (Lawrenceville), Jeremiah House (Keyport), St. Theresa (Tuckerton)","Year Born":1940,"Year Ordained":1965,"Victim Number":"","Status":"Deceased"},{"Last_name":"McGrath","First_name_MI":"M. Francis","Diocese":"Trenton","Churches":"St. James (Red Bank), St. Anthony (Trenton), St. Justin (Toms River)","Year Born":1950,"Year Ordained":1978,"Victim Number":"","Status":"Removed From Ministry"},{"Last_name":"McHugh","First_name_MI":"Joseph F.","Diocese":"Trenton","Churches":"St. Mary (New Monmouth), Our Lady of Perpetual Help (Maple Shade), St. Gregory the Great (Hamilton Square), St. Raphael (Hamilton), St. Joseph (Beverly), St. Veronica (Howell), St. Thomas Moore (Manalapan)","Year Born":1946,"Year Ordained":1973,"Victim Number":"","Status":"Deceased"},{"Last_name":"McKeone","First_name_MI":"William J.","Diocese":"Trenton","Churches":"St. Dominic (Bricktown), St. Denis (Manasquan), St. Mary of the Lakes (Medford), Our Lady Queen of Peace (Hainesport), Chaplain - Morris Hall (Lawrenceville), Voluntas Dei Institute","Year Born":1947,"Year Ordained":"","Victim Number":"","Status":""},{"Last_name":"Milewski","First_name_MI":"Richard R.","Diocese":"Trenton","Churches":"Corpus Christi (Willingboro), St. Veronica (Howell), St. Anthony of Padua (Hightstown), St. Mary (Barnegat), Holy Eucharist (Tabernacle), St. Rose of Lima (Freehold)","Year Born":1946,"Year Ordained":1983,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Minogue","First_name_MI":"Liam A.","Diocese":"Trenton","Churches":"Chaplian - Monmouth County Scouts, St. Rose of Lima (Freehold), Incarnation (Trenton), St. Anthony (Trenton), St. Veronica (Howell), Our Lady of Victories (Baptistown), St. George (Washington Crossing), St. Martha (Point Pleasant), St. Peter (New Brunswick), St. John the Baptist (New Brunswick), Mary Mother of God (Hillsborough)","Year Born":1943,"Year Ordained":1968,"Victim Number":"","Status":"Deceased"},{"Last_name":"Muccilli","First_name_MI":"Sebastian L.","Diocese":"Trenton","Churches":"St. Mary (Alpha), St. Anthony (Hightstown), Chaplain - U.S. Navy, Chaplain - Rutgers University (New Brunswick), Faculty - Sacred Heart School of Theology (Franklin, WI)","Year Born":1930,"Year Ordained":1957,"Victim Number":"","Status":"Deceased"},{"Last_name":"Parenti","First_name_MI":"Robert J.","Diocese":"Trenton","Churches":"St. Veronica (Howell), St. Denis (Manasquan), Assumption (New Egypt), Our Lady of Peace (Normandy Beach)","Year Born":1939,"Year Ordained":1972,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Prioli","First_name_MI":"Joseph J.","Diocese":"Trenton","Churches":"St. Catherine of Siena (Farmingdale)","Year Born":1968,"Year Ordained":2005,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Punderson","First_name_MI":"Joseph R.","Diocese":"Trenton","Churches":"Christ the King (Manville), St. Mary (Trenton), Sacred Heart (Trenton), Vice Chancellor (Diocese of Trenton), Morris Hall (Lawrenceville), Apostolic Signatura (Vatican)","Year Born":1948,"Year Ordained":1976,"Victim Number":"","Status":"Removed from ministry"},{"Last_name":"Rittenhouse","First_name_MI":"Thomas A.","Diocese":"Trenton","Churches":"St. Denis (Manasquan), St. James (Woodbridge), St. Anthony (Trenton), Holy Cross (Rumson), St. Anthony of Padua (Hightstown), St. Clement (Matawan) St. Agnes (Atlantic Highlands), St. Peter (Riverside)","Year Born":1949,"Year Ordained":1976,"Victim Number":"","Status":"Deceased"},{"Last_name":"Sullivan","First_name_MI":"John E.","Diocese":"Trenton","Churches":"Our Lady of Victories (Sayreville), St. Agnes (Atlantic Highlands), Holy Spirit (Asbury Park), Incarnation (Trenton), Mary Mother of God (Hillsborough), St. Joseph (Beverly), St. Gabriel (Marlboro)","Year Born":1916,"Year Ordained":1949,"Victim Number":"","Status":"Deceased"},{"Last_name":"Tumang","First_name_MI":"Florencio P.","Diocese":"Trenton","Churches":"St. John Vianney (Colonia), St. Catherine (Middletown), St. Mary of the Lakes (Medford)","Year Born":1923,"Year Ordained":1980,"Victim Number":"","Status":"Deceased"},{"Last_name":"Williams","First_name_MI":"H. Brendan","Diocese":"Trenton","Churches":"St. Joan of Arc (Marlton), Holy Angels (Hamilton), Chaplain - St. Thomas Aquinas High School (Edison), St. Veronica (Howell)","Year Born":1940,"Year Ordained":1965,"Victim Number":"","Status":"Removed from ministry"}]